//----------------------------------------------
//Program No.8
//dispTikaFare
//(c)2016 Kyoto Municipal Transportation Bureau
//選択駅からの地下鉄運賃を表示
//----------------------------------------------
//
function dispTikaFare(lang,cokid){
//cookieから取り出す。
var cokid;
//表示言語によって円の訳語を切替
var unit = "円";
var dept = "出発";
switch(lang)
  {
    case "ja":
      break;
    case "en":
	  unit = "Yen";
	  dept = "Dept.";
      break;
    case "sc":
      unit = "日元"
	  dept = "出发";
      break;
    case "tc":
      unit = "日圓"
	  dept = "出發";
      break;
    case "ko":
    　unit = "엔"
	  dept = "출발";
      break;
    default:
      break;
  }
$('#ekicode').change(function () {
	var Sta = new Array(30);
	Sta[0] = "5555554433333333444443333222211";
	Sta[1] = "555544433332223334433332222111";
	Sta[2] = "55544443322222233433332222111";
	Sta[3] = "5544443322222222333332222211";
	Sta[4] = "554443332222122223332222111";
	Sta[5] = "54443332222211222332222211";
	Sta[6] = "4443333221111112222222111";
	Sta[7] = "444333221111*11122222111";
	Sta[8] = "44433332211111122222111";
	Sta[9] = "5444333222211122222111";
	Sta[10] = "554443332222122222111";
	Sta[11] = "55444433222222223111";
	Sta[12] = "5554443332222222311";
	Sta[13] = "555544433322222331";
	Sta[14] = "55554443333222333";
	Sta[15] = "5554443322222211";
	Sta[16] = "554443332222111";
	Sta[17] = "54443332221111";
	Sta[18] = "4443333221111";
	Sta[19] = "444333221111";
	Sta[20] = "44333222111";
	Sta[21] = "4333322211";
	Sta[22] = "433322211";
	Sta[23] = "33322221";
	Sta[24] = "3322211";
	Sta[25] = "222211";
	Sta[26] = "22211";
	Sta[27] = "2211";
	Sta[28] = "211";
	Sta[29] = "11";
	Sta[30] = "1";
	Sta[31] = "";
	//地下鉄運賃 H26.4.1改定
	//消費税率変更　R01.10.1改定
	var fsuba = "220,260,290,330,360";
	var fsubc = "110,130,150,170,180";

	/* R01.9.30まで
	var fsuba = "210,260,290,320,350";
	var fsubc = "110,130,150,160,180";
	*/
	/* H26.3.31まで
	var fsuba = "210,250,280,310,340";
	var fsubc = "110,130,140,160,170";
	*/

	//大津線の運賃
	//[6]は御陵駅
	var fka = new Array(7);
	var fkc = new Array(7);

	fka[0] = "330,330,430,480,480,580";
	fka[1] = "420,420,500,500,500,600";
	fka[2] = "390,390,470,520,520,620";
	fka[3] = "460,460,540,540,540,640";
	fka[4] = "490,490,570,570,570,670";
	fka[5] = "530,530,610,610,610,710";
	fka[6] = "xxx,xxx,xxx,xxx,xxx,xxx";

	fkc[0] = "170,170,220,240,240,290";
	fkc[1] = "210,210,250,250,250,300";
	fkc[2] = "200,200,240,260,260,310";
	fkc[3] = "230,230,270,270,270,320";
	fkc[4] = "250,250,290,290,290,340";
	fkc[5] = "270,270,310,310,310,360";
	fkc[6] = "xxx,xxx,xxx,xxx,xxx,xxx";

	/* 大津線旧運賃
//R01.9.30まで
	fka[0] = "290,290,380,430,460,510";
	fka[1] = "380,380,450,450,480,530";
	fka[2] = "360,360,430,480,510,560";
	fka[3] = "430,430,500,500,530,580";
	fka[4] = "460,460,530,530,560,610";
	fka[5] = "490,490,560,560,590,640";
	fka[6] = "xxx,xxx,xxx,xxx,xxx,xxx";

	fkc[0] = "160,160,200,220,240,260";
	fkc[1] = "200,200,230,230,250,270";
	fkc[2] = "190,190,220,240,260,280";
	fkc[3] = "220,220,250,250,270,290";
	fkc[4] = "240,240,270,270,290,310";
	fkc[5] = "250,250,280,280,300,320";
	fkc[6] = "xxx,xxx,xxx,xxx,xxx,xxx";

//H26.3.31まで
	fka[0] = "280,290,370,420,450,500";
	fka[1] = "370,380,440,440,470,520";
	fka[2] = "340,350,410,460,490,540";
	fka[3] = "410,420,480,480,510,560";
	fka[4] = "440,450,510,510,540,590";
	fka[5] = "470,480,540,540,570,620";
	fka[6] = "xxx,xxx,xxx,xxx,xxx,xxx";
	//fka[6] = "160,170,230,230,260,310";

	fkc[0] = "150,160,200,220,230,260";
	fkc[1] = "190,200,230,230,240,270";
	fkc[2] = "180,190,220,240,250,280";
	fkc[3] = "210,220,250,250,260,290";
	fkc[4] = "220,230,260,260,270,300";
	fkc[5] = "240,250,280,280,290,320";
	fkc[6] = "xxx,xxx,xxx,xxx,xxx,xxx";
	//fkc[6] = "80,090,120,120,130,160";

//R07.9.30まで
	fka[0] = "300,300,390,440,470,530";
	fka[1] = "390,390,460,450,490,550";
	fka[2] = "360,360,430,480,510,570";
	fka[3] = "430,430,500,500,530,590";
	fka[4] = "460,460,530,530,560,620";
	fka[5] = "500,500,570,570,600,660";
	fka[6] = "xxx,xxx,xxx,xxx,xxx,xxx";

	fkc[0] = "160,160,200,220,240,270";
	fkc[1] = "200,200,230,230,250,280";
	fkc[2] = "190,190,220,240,260,290";
	fkc[3] = "220,220,250,250,270,300";
	fkc[4] = "240,240,270,270,290,320";
	fkc[5] = "260,260,290,290,310,340";
	fkc[6] = "xxx,xxx,xxx,xxx,xxx,xxx";

	*/

	//近鉄線の運賃
	var fkina = new Array(7);
	var fkinc = new Array(7);
	fkina[0] = "380,450,520,580,650,710,750,810,900,980,1050,1130";
	fkina[1] = "430,490,560,620,690,750,790,850,940,1020,1090,1170";
	fkina[2] = "440,500,560,620,690,750,790,850,940,1020,1090,1170";
	fkina[3] = "470,530,590,650,720,780,820,880,970,1050,1120,1200";
	fkina[4] = "510,570,630,690,760,820,860,920,1010,1090,1160,1240";
	fkina[5] = "540,600,660,720,790,850,890,950,1040,1120,1190,1270";
	fkina[6] = "xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx";

	fkinc[0] = "190,220,260,290,330,360,380,410,450,490,530,570";
	fkinc[1] = "210,240,280,310,350,380,400,430,470,510,550,590";
	fkinc[2] = "220,250,280,310,350,380,400,430,470,510,550,590";
	fkinc[3] = "240,270,300,330,370,400,420,450,490,530,570,610";
	fkinc[4] = "260,290,320,350,390,420,440,470,510,550,590,630";
	fkinc[5] = "270,300,330,360,400,430,450,480,520,560,600,640";
	fkinc[6] = "xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx";

	/* 近鉄線旧運賃
//R07.10.30更新
	fkina[0] = "360,420,480,520,580,630,670,720,790,860,920,990";
	fkina[1] = "410,460,520,560,620,670,710,760,830,900,960,1030";
	fkina[2] = "420,470,520,560,620,670,710,760,830,900,960,1030";
	fkina[3] = "450,500,550,590,650,700,740,790,860,930,990,1060";
	fkina[4] = "490,540,590,630,690,740,780,830,900,970,1030,1100";
	fkina[5] = "520,570,620,660,720,770,810,860,930,1000,1060,1130";
	fkina[6] = "xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx";

	fkinc[0] = "180,210,240,260,290,320,340,360,400,430,460,500";
	fkinc[1] = "200,230,260,280,310,340,360,380,420,450,480,520";
	fkinc[2] = "210,240,260,280,310,340,360,380,420,450,480,520";
	fkinc[3] = "230,260,280,300,330,360,380,400,440,470,500,540";
	fkinc[4] = "250,280,300,320,350,380,400,420,460,490,520,560";
	fkinc[5] = "260,290,310,330,360,390,410,430,470,500,530,570";
	fkinc[6] = "xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx";

//R01.9.30まで
	fkina[0] = "340,410,470,510,560,610,650,700,770,830,900,960";
	fkina[1] = "400,460,520,560,610,660,700,750,820,880,950,1010";
	fkina[2] = "410,470,520,560,610,660,700,750,820,880,950,1010";
	fkina[3] = "440,500,550,590,640,690,730,780,850,910,980,1040";
	fkina[4] = "470,530,580,620,670,720,760,810,880,940,1010,1070";
	fkina[5] = "500,560,610,650,700,750,790,840,910,970,1040,1100";
	fkina[6] = "xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx";

	fkinc[0] = "180,210,240,260,290,310,330,360,390,420,460,490";
	fkinc[1] = "200,230,260,280,310,330,350,380,410,440,480,510";
	fkinc[2] = "210,240,260,280,310,330,350,380,410,440,480,510";
	fkinc[3] = "230,260,280,300,330,350,370,400,430,460,500,530";
	fkinc[4] = "240,270,290,310,340,360,380,410,440,470,510,540";
	fkinc[5] = "260,290,310,330,360,380,400,430,460,490,530,560";
	fkinc[6] = "xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx";

//H26.3.31まで
	fkina[0] = "340,400,460,500,550,600,640,690,750,820,880,940";
	fkina[1] = "390,440,500,540,590,640,680,730,790,860,920,980";
	fkina[2] = "400,450,500,540,590,640,680,730,790,860,920,980";
	fkina[3] = "430,480,530,570,620,670,710,760,820,890,950,1010";
	fkina[4] = "460,510,560,600,650,700,740,790,850,920,980,1040";
	fkina[5] = "490,540,590,630,680,730,770,820,880,950,1010,1070";
	fkina[6] = "xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx";
	//fkina[6] = "150,200,250,290,340,390,430,480,540,610,670,730";

	fkinc[0] = "180,200,240,260,280,310,330,350,380,420,450,480";
	fkinc[1] = "200,220,260,280,300,330,350,370,400,440,470,500";
	fkinc[2] = "210,230,260,280,300,330,350,370,400,440,470,500";
	fkinc[3] = "220,240,270,290,310,340,360,380,410,450,480,510";
	fkinc[4] = "240,260,290,310,330,360,380,400,430,470,500,530";
	fkinc[5] = "250,270,300,320,340,370,390,410,440,480,510,540";
	fkinc[6] = "xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx,xxx";
	//fkinc[6] = "80,100,130,150,170,200,220,240,270,310,340,370";

	*/
	//クッキーがあればクッキーの値を採用し削除する。
	
	var cngid;
	if(cokid == ""){
			cngid = $('#ekicode').val();
	}else{
		if(cokid != cngid){
			cngid = cokid;
			$('#ekicode').val(cngid);
			cokid = "";
		}
	}
	
	//if(cngid ==  "19"){ cngid = "7";}
	
	//選択駅所属路線のメニューを展開する
	if (parseInt(cngid) < 15) {
		//$("#ac1").trigger("click");
		$("#c1").collapse('show');
		$("#c2").collapse('hide');
		position = $("#h1").offset().top;
		
		$("#ac1 > i").removeClass('fa-chevron-down');
		$("#ac1 > i").addClass('fa-chevron-up');
		
	}else{
		$("#c1").collapse('hide');
		$("#c2").collapse('show');
		//$("#ac2").trigger("click");
		position = $("#h2").offset().top;
		$("#ac2 > i").removeClass('fa-chevron-down');
		$("#ac2 > i").addClass('fa-chevron-up');
	}

	//運賃計算
	var i;
	var s;	//当駅
	var d;	//他駅
	var t;
	var c;	//区数
	

	//当駅と他駅を全部見て何区か求める。
	for (i = 0; i < 32; i = i + 1){
		s = cngid;
		s = s * 1;	//数値型に変換
		if (i != s){
			d = i;
		//当駅のコードが他駅のコードより大きければ入れ替え
			if (d < s){
				t = d;d = s;s = t;
			}
			//window.alert(s + "/" + d);
			c = Sta[s].length - (d - s);
			
			var fare_subway_a = fsuba.split(",");
			var fare_subway_c = fsubc.split(",");
			var kusu = Sta[s].charAt(c);
			$('#fstp'+i).html('<span class="fare-adult" title="'+kusu+'区おとな">' + fare_subway_a[kusu-1] + '<\/span><span class="cash-unit">' + unit + '<\/span><br><span class="fare-child" title="'+kusu+'区こども">' + fare_subway_c[kusu-1] + '<\/span><span class="cash-unit">' + unit + '<\/span>');
			$('#fstp'+i).css("white-space","nowrap");
		}
	}
	//京津線の運賃表示
	//自駅が決まれば自動的に決まる。
	//window.alert(cngid);
	var kf;
	switch (cngid) {
		/*蹴上23，東山22*/
		case "22": case "23":
			kf = 0;
			break;
		/*東野26，山科25*/
		case "25": case "26":
			kf = 1;
			break;
		/*三条京阪21*/
		case "21":
			kf = 2;
			break;
		/*今出川5，丸太町6，烏丸御池7，四条8，五条9，醍醐29，小野28，椥辻27，市役所前20，烏丸御池19，二条城前18，二条17*/
 		case "5": case "6": case "7": case "8": case "9": case "17": case"18": case "19": case "20": case "27": case "28": case "29":
			kf = 3;
			break;
		/*松ヶ崎1，北山2，北大路3，鞍馬口4，京都10，九条11，十条12，くいな橋13，竹田14，六地蔵31，石田30，西大路御池16，太秦天神川15*/
		case "1": case "2": case "3": case "4": case "10": case "11": case "12": case "13": case "14": case "15": case "16": case "30": case "31":
			kf = 4;
			break;
		/*国際会館0*/
		case "0":
			kf = 5;
			break;
		/*御陵24*/
		case "24":
			kf = 6;
			break;
	}
		//window.alert(kf);
			var idx;
			for (i = 100; i < 126; i = i + 1){
				if(i < 102){
					idx = 0;
				}else if(i < 104){
					idx = 1;
				}else if(i < 106){
					idx = 2;
				}else if(i < 108){
					idx = 3;
				}else if(i < 114){
					idx = 4;
				}else{
					idx = 5;
				}
				var fare_keihan_a = fka[kf].split(",");
				var fare_keihan_c = fkc[kf].split(",");
				$('#fstp'+i).html('<span class="fare-adult-other">' + fare_keihan_a[idx] + '<\/span><span class="cash-unit">' + unit + '<\/span><br><span class="fare-child-other">' + fare_keihan_c[idx] + '<\/span><span class="cash-unit">' + unit + '<\/span>');
				$('#fstp'+i).css("white-space","nowrap");
			}
	//近鉄線の運賃表示
	//自駅が決まれば自動的に決まる。
	switch (cngid) {
		/*九条11，十条12，くいな橋13*/
		case "11": case "12": case "13":
			kf = 0;
			break;
		/*京都10*/
		case "10":
			kf = 1;
			break;
		/*丸太町6，烏丸御池（烏丸線）7，四条8，五条9，京都市役所前20，烏丸御池（東西線）19，二条城前18*/
		case "6": case "7": case "8": case "9": case "18": case "19": case "20":
			kf = 2;
			break;
		/*北大路3，鞍馬口4，今出川5，御陵24，蹴上23，東山22，三条京阪21，二条17，西大路御池16，太秦天神川15*/
 		case "3": case "4": case "5": case "15": case "16": case "17": case"21": case "22": case "23": case "24":
			kf = 3;
			break;
		/*国際会館0，松ヶ崎1，北山2，椥辻27，東野26，山科25*/
		case "0": case "1": case "2": case "25": case "26": case "27":
			kf = 4;
			break;
		/*六地蔵31，石田30，醍醐29，小野28*/
		case "28": case "29": case "30": case "31":
			kf = 5;
			break;
		/*竹田15*/
		case "14":
			kf = 6;
			break;
	}
			for (i = 200; i < 237; i = i + 1){
				if(i < 203){
					idx = 0;
				}else if(i < 204){
					idx = 1;
				}else if(i < 207){
					idx = 2;
				}else if(i < 210){
					idx = 3;
				}else if(i < 212){
					idx = 4;
				}else if(i < 215){
					idx = 5;
				}else if(i < 218){
					idx = 6;
				}else if(i < 220){
					idx = 7;
				}else if(i < 227){
					idx = 8;
				}else if(i < 233){
					idx = 9;
				}else if(i < 236){
					idx = 10;
				}else{
					idx = 11;
				}
				var fare_kin_a = fkina[kf].split(",");
				var fare_kin_c = fkinc[kf].split(",");
				$('#fstp'+i).html('<span class="fare-adult-other">' + fare_kin_a[idx] + '<\/span><span class="cash-unit">' + unit + '<\/span><br><span class="fare-child-other">' + fare_kin_c[idx] + '<\/span><span class="cash-unit">' + unit + '<\/span>');
				$('#fstp'+i).css("white-space","nowrap");
			}
	//出発駅
	$('#fstp'+cngid).html(dept);
	if(cngid ==  "19" || cngid ==  "7"){$('#fstp7').html(dept);$('#fstp19').html(dept);}
	//ページ内移動
	$("html, body").animate({scrollTop:position}, 550, "swing");
}).change();
	
	
//折り畳み展開時にアイコン差し替え
	$('#c1, #c2')
      .on('show.bs.collapse', function() {
        $('a[href="#' + this.id + '"]').find('.fa-chevron-down')
          .removeClass('fa-chevron-down').addClass('fa-chevron-up');
      })
      .on('hide.bs.collapse', function() {
        $('a[href="#' + this.id + '"]').find('.fa-chevron-up')
          .removeClass('fa-chevron-up').addClass('fa-chevron-down');
	});


}

//});
